# AssemblyMemberDifferentGeometry Class

---
The two assembly members being compared have different geometry
SystemObject Autodesk.Revit.DBAssemblyMemberDifference Autodesk.Revit.DBAssemblyMemberDifferentGeometry
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class AssemblyMemberDifferentGeometry : AssemblyMemberDifference

    Public Class AssemblyMemberDifferentGeometry
    	Inherits AssemblyMemberDifference

    public ref class AssemblyMemberDifferentGeometry : public AssemblyMemberDifference

    type AssemblyMemberDifferentGeometry =
        class
            inherit AssemblyMemberDifference
        end
The AssemblyMemberDifferentGeometry type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyMemberDifference)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from AssemblyMemberDifference)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace